tutorials/rouse_profile/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
    type            cyclic;
    }
    outlet
    {
        type        cyclic;
    }
    top
    {
      type  fixedValue;
      value uniform 0;
    }
    walls
    {
      type  fixedFluxPressure;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
